# ProjectGridsOnSectionBox Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..ProjectGridsOnSectionBox Property
View3D Class See Also
---
This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool ProjectGridsOnSectionBox { get; set; }
```

Visual Basic
---
```text
Public Property ProjectGridsOnSectionBox As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ProjectGridsOnSectionBox {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Returns true if the view is not a view template. |

# See Also
View3D Class
Autodesk.Revit.DB Namespace